app/controllers/movies_controller.rb

SELECT * FROM "movies" WHERE (rating in ('G','PG')) ORDER BY release_date
---
  def index

    self.patch_params
    if (@params_changed)
      redirect_to :action => "index", :ratings => params[:ratings], :sort_by => params[:sort_by]
    end

    @all_ratings = Movie.all_ratings

    @sort_by = params[:sort_by]

    @sort_by_title = (params[:sort_by] == "title")
    @sort_by_release_date = (params[:sort_by] == "release_date")

    @movies = Movie.select("*");